Repository: NickVolynkin/imagineui-website
Catalog: docs/source/locale/*/LC_MESSAGES/syntax.po
Languages: es, ru

source: Page blocks
es: Bloques de la página
ru: Блоки интерфейса

source: Page elements
es: Elementos de la página
ru: Элементы интерфейса

source: Modifiers
es: Modificadores
ru: Модификаторы

source: Layouts
es: Maquetación
ru: Расположения

source: Data types
es: Tipos de datos
ru: Типы данных

source: Syntax
es: Sintaxis
ru: Синтаксис

source: Aligned
es: Alineado
ru: Расположены

source: Use this keyword to align elements in a block:
es: Utiliza la siguente palabra clave para alinear los elementos dentro de un bloque:
ru: Используйте это ключевое слово чтобы задать расположение элементов в блоке:

source: Block
es: Bloque
ru: Блок

source: Usage
es: Uso
ru: Использование

source: Use ``Block`` to define major areas of a :doc:`page`. Each page can contain one or more blocks.
es: Utiliza ``Bloque`` para definir las principales partes de una :doc:`página <page>`. Cada página puede contener uno o varios bloques.
ru: Используйте ``Блок`` чтобы обозначить крупные области :doc:`страницы <page>`. Каждая страница может содержать один или более блоков.

source: Page "Signup" Block "Personal data" Field "Name" Field "Surname" Field "e-mail" Button "Sign up"
es: Página "Registrarse" Bloque "Datos personales" Campo "Nombre" Campo "Apellidos" Campo "correo electrónico" Botón "Registrarse"

source: Note that you can define :ref:`layouts <layout>` for elements in a block.
es: También puedes definir el :ref:`diesño <layout>` para los elementos en un bloque.
ru: Обратите внимание, что для элементов внутри блока можно задать :ref:`расположение <layouts>`.

source: Button
es: Botón
ru: Кнопка

source: Use the ``Button`` keyword for anything clickable on a page:
es: Utiliza la palabra clave ``Botón`` para cualquier elemento cliqueable en la página:
ru: Используйте ключевое слово ``Кнопка`` для всего, что можно нажать:

source: As with other keywords, word order and capitalization are optional:
es: Igual que con otras palabras claves el orden de palabras y la capitalización son opcionales:
ru: Как и с остальными ключевыми словами, порядок слов и заглавные буквы опциональны:

source: ... "Sign up" button "Log in" button
es: ... "Registrarse" botón "Entrar" botón

source: Examples
es: Ejemplos
ru: Примеры

source: Buttons in an installation wizard:
es: Botones en un asistente de instalación:
ru: Кнопки в мастере установки:

source: Page "Installation Wizard" Block "Settings" "Some settings here" Block "Navigation" Button "Cancel" Button "Previous" Button "Next"
es: Página "Asistente de instalación" Bloque "Ajustes" "Aquí van algunos ajustes" Bloque "Navegación" Botón "Cancelar" Botón "Anterior" Botón "Siguente"

source: Columns
es: Columnas
ru: Столбец

source: Use ``Columns`` with a :doc:`number <numbers>` to arrange elements in one or more columns.
es: Utiliza ``Columnas`` con el :doc:`número <numbers>` para ordenar y repartir los elementos en una o varias columnas.
ru: Используйте ``Столбцы`` вместе с :doc:`числом <numbers>` чтобы организовать элементы в один или больше столбцов.

source: For example, a vertical menu:
es: Por ejemplo, una navegación vertical:
ru: Например, вертикальное меню:

source: Block "Navigation" One column "Profile" "Friends" "Messages" "Settings"
es: Bloque "Navegación" Una columna "Perfíl" "Amigos" "Mensajes" "Ajustes"

source: Or, an online store:
es: O una tienda online:
ru: Или онлайн-магазин:

source: Block "Store" Three columns List of things on sale Consists of Header Image "Buy now" Button
es: Bloque "Tienda" Tres columnas Lista de las cosas en venta Consiste de Encabezado Imágen "Comprar ahora" Botón

source: Consists of
es: Consiste de
ru: Включает в себя

source: Use the ``Consists of`` keyword to fill a :doc:`list <list>` with typical elements:
es: Utiliza las palabras claves ``Consiste de`` para rellenar una :doc:`lista <list>` con los elementos correspondientes:
ru: Используйте ключевое слово ``Включает в себя`` чтобы заполнить :doc:`список <list>` типовыми элементами:

source: Example
es: Ejemplo
ru: Пример

source: Field
es: Campo
ru: Поле

source: ``Field`` is any text that the user types on a page.
es: ``Campo`` representa cualquier texto que el usuario introduce en la página.
ru: ``Поле`` — это любой текст, который пользователь вводит на странице.

source: Header
es: Encabezado
ru: Заголовок

source: Use ``Header`` to highlight short lines of text:
es: Utiliza ``Encabezado`` para resaltar algunos elementos del texto:
ru: Используйте ``Заголовок`` чтобы выделить небольшую строку:

source: Page "Blog post" Block "Text" Header "Post title" "Author's name" Image for drawing attention "Text"
es: Página "Una publicación en el blog" Bloque "Texto" Encabezado "Título de la publicación" "Nombre del autor" Una imágen llamativa "Texto"

source: Image
es: Imágen
ru: Картинка

source: Use ``Image`` to define the place to put an image, diagram or video. Don't bother providing a real image. Instead, the mockup will have an image placeholder. Text is optional.
es: Utiliza ``Imágen`` para definir el sitio de una imágen, diagrama o vídeo. No te preocupes por poner una imágen real: la maqueta tendrá una imágen que sirve de placeholder. El texto es opcional.
ru: Используйте ключевое слово ``Картинка`` чтобы обозначить место для изображения, диаграммы или видео. Не трудитесь находить настоящую картинку. Вместо неё будет плейсхолдер. Текст на картинке опционален.

source: Page "Flowers shop" Block "Flowers" Two columns Image "Roses are red," Image "Violets are blue." Image "Your mockups are great," Image "And so are you!"
es: Página "Floristería" Bloque "Flores" Dos columnas Imágen "Las rosas son rojas," Imágen "Cuidado que pinchas sus hojas." Imágen "Esta maqueta mola mucho," Imágen "Toma helado en cucurucho!"

source: List
es: Lista
ru: Список

source: Main
es: Principal
ru: Главный

source: Numbers
es: Números
ru: Числа

source: Page
es: Página
ru: Страница

source: Start every scene with ``Page`` keyword and a name:
es: Empieza cada escena con la palabra clave ``Página`` y un nombre:
ru: Начинайте каждую сцену с ключевого слова ``Страница`` с названием.

source: Page "Signup" Block "Top menu" ... Block "Personal data" ... Block "Footer"
es: Página "Registrarse" Bloque "Navegación principal" ... Bloque "Datos personales" ... Bloque "Pie de página"

source: The page's name is there just for you to remember what each scene is about. It does not appear on the rendered mockup.
es: El nombre de la página está para que te acuerdes mejor de qué va cada escena y no va a aparecer en la maqueta procesada.
ru: Название страницы поможет вам запомнить, что описывает эта сцена. Оно не выводится на мокап.

source: Word order and capitalization are optional. Use it to your convenience:
es: El órden de palabras y la capitalización son opcionales. Puedes utilizarlo a tu conveniencia:
ru: Порядок слов и заглавные буквы опциональны. Используйте их, как вам удобно:

source: "Signup" page ...
es: página "Registrarse" ...

source: Rows
es: Filas
ru: Строки

source: Use ``Columns`` with a :doc:`number <numbers>` to arrange elements in one or more rows (lines).
es: Utiliza ``Columnas`` con un :doc:`número <numbers>` para repartir los elementos en una o más filas.
ru: Используйте ``Строки`` вместе с :doc:`числом <numbers>` чтобы организовать элементы в одну или больше строк.

source: For example, a horizontal menu, like the one on this website:
es: Por ejemplo, una navegación horizontal como en esta página web:
ru: Например, горизонтальное меню, точно как на этом сайте:

source: Block "Top-menu" One row "ImagineUI" "Sandbox" "Docs"
es: Bloque "Navegación principal" Una fila "ImagineUI" "Sandbox" "Documentos"

source: Text
es: Texto
ru: Текст

source: To add some non-interactive text on your mockup, just write it in quotes:
es: Puedes añadir texto simple en tu maqueta, escríbelo en comillas:
ru: Чтобы добавить в мокап неинтерактивный текст, напишите его в кавычках:

source: Page "Very simple page" Block "Greeting" "Hello!" "You look awesome today."
es: Página "Una página muy normal" Bloque "Bienvenido" "Hola:" "¡Hoy vas a tener un día estupendo!"

source: With icon
es: Con ícono
ru: С иконкой

source: Use the ``With icon`` modifier to attach an icon to a :doc:`button`.
es: Utiliza el modificador ``Con ícono`` para adjuntar un ícono al :doc:`botón`.
ru: Используйте модификатор ``с иконкой``, чтобы добавить иконку к :doc:`кнопке <button>`.
